8BIT0/TDrone_MCU_App/HW_Lib/STM32H7/BSP/Bsp_Uart.c
/*
 * coder : 8_B!T0
 * bref : default using uart dma transfer
 */
#include "stm32h743xx.h"
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal_rcc.h"
#include "stm32h7xx_hal_uart.h"
#include "Bsp_Uart.h"

#define To_Uart_Instance(x) ((USART_TypeDef *)x)
#define To_Uart_Handle_Ptr(x) ((UART_HandleTypeDef *)x)
#define To_UartDMA_Handle_Ptr(x) ((DMA_HandleTypeDef *)x)

#define BspUart_Opr_TimeOut 100 // 100ms

/* internal variable */
static BspUARTObj_TypeDef *BspUart_Obj_List[Bsp_UART_Port_Sum] = {NULL};

/* internal function */

/* external function */
static bool BspUart_Init(BspUARTObj_TypeDef *obj);
static bool BspUart_DeInit(BspUARTObj_TypeDef *obj);
static bool BspUart_Set_DataBit(BspUARTObj_TypeDef *obj, uint32_t bit);
static bool BspUart_Set_Parity(BspUARTObj_TypeDef *obj, uint32_t parity);
static bool BspUart_Set_StopBit(BspUARTObj_TypeDef *obj, uint32_t stop_bit);
static bool BspUart_Swap_Pin(BspUARTObj_TypeDef *obj, bool swap);
static bool BspUart_Transfer(BspUARTObj_TypeDef *obj, uint8_t *tx_buf, uint16_t size);
static bool BspUart_Set_Rx_Callback(BspUARTObj_TypeDef *obj, BspUART_Callback callback);
static bool BspUart_Set_Tx_Callback(BspUARTObj_TypeDef *obj, BspUART_Callback callback);

BspUART_TypeDef BspUart = {
    .init = BspUart_Init,
    .de_init = BspUart_DeInit,
    .set_parity = BspUart_Set_Parity,
    .set_stop_bit = BspUart_Set_StopBit,
    .set_data_bit = BspUart_Set_DataBit,
    .set_swap = BspUart_Swap_Pin,
    .send = BspUart_Transfer,
    .set_rx_callback = BspUart_Set_Rx_Callback,
    .set_tx_callback = BspUart_Set_Tx_Callback,
};

static int BspUart_Init_Clock(BspUARTObj_TypeDef *obj)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    int8_t index = Bspuart_None_Index;

    if ((obj == NULL) ||
        (To_Uart_Instance(obj->instance) == NULL))
        return BspUart_Clock_Error;

    if (To_Uart_Instance(obj->instance) == USART1)
    {
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART1;
        PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART1CLKSOURCE_D2PCLK2;

        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_RCC_USART1_CLK_ENABLE();
        index = Bsp_UART_Port_1;
    }
    else if (To_Uart_Instance(obj->instance) == UART4)
    {
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_UART4;
        PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;

        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_RCC_UART4_CLK_ENABLE();
        index = Bsp_UART_Port_4;
    }
    else if (To_Uart_Instance(obj->instance) == USART6)
    {
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USART6;
        PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_D2PCLK2;

        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_RCC_USART6_CLK_ENABLE();
        index = Bsp_UART_Port_6;
    }
    else if (To_Uart_Instance(obj->instance) == UART7)
    {
        PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_UART7;
        PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_D2PCLK1;

        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_RCC_UART7_CLK_ENABLE();
        index = Bsp_UART_Port_7;
    }
    else
        return BspUart_Clock_Error;

    /* rx tx pin init */
    BspGPIO.alt_init(obj->rx_io, GPIO_MODE_AF_PP);
    BspGPIO.alt_init(obj->tx_io, GPIO_MODE_AF_PP);

    return index;
}

static int BspUart_Init_DMA(BspUARTObj_TypeDef *obj)
{
    DMA_HandleTypeDef tx_dma_cfg = {0};
    DMA_HandleTypeDef rx_dma_cfg = {0};
    int8_t index = Bspuart_None_Index;
    bool rx_dma_reg_state = false;
    bool tx_dma_reg_state = false;

    tx_dma_cfg.Init.PeriphInc = DMA_PINC_DISABLE;
    tx_dma_cfg.Init.MemInc = DMA_MINC_ENABLE;
    tx_dma_cfg.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    tx_dma_cfg.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    tx_dma_cfg.Init.Mode = DMA_NORMAL;
    tx_dma_cfg.Init.Priority = DMA_PRIORITY_MEDIUM;
    tx_dma_cfg.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    tx_dma_cfg.Init.Direction = DMA_MEMORY_TO_PERIPH;

    rx_dma_cfg.Init.PeriphInc = DMA_PINC_DISABLE;
    rx_dma_cfg.Init.MemInc = DMA_MINC_ENABLE;
    rx_dma_cfg.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    rx_dma_cfg.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    rx_dma_cfg.Init.Mode = DMA_NORMAL;
    rx_dma_cfg.Init.Priority = DMA_PRIORITY_MEDIUM;
    rx_dma_cfg.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    rx_dma_cfg.Init.Direction = DMA_PERIPH_TO_MEMORY;

    if ((obj == NULL) ||
        (To_Uart_Instance(obj->instance) == NULL))
        return BspUart_Clock_Error;

    if (To_Uart_Instance(obj->instance) == USART1)
    {
        rx_dma_cfg.Init.Request = DMA_REQUEST_USART1_RX;
        tx_dma_cfg.Init.Request = DMA_REQUEST_USART1_TX;

        index = Bsp_UART_Port_1;
    }
    else if (To_Uart_Instance(obj->instance) == UART4)
    {
        rx_dma_cfg.Init.Request = DMA_REQUEST_UART4_RX;
        tx_dma_cfg.Init.Request = DMA_REQUEST_UART4_TX;

        index = Bsp_UART_Port_4;
    }
    else if (To_Uart_Instance(obj->instance) == USART6)
    {
        rx_dma_cfg.Init.Request = DMA_REQUEST_USART6_RX;
        tx_dma_cfg.Init.Request = DMA_REQUEST_USART6_TX;

        index = Bsp_UART_Port_6;
    }
    else if (To_Uart_Instance(obj->instance) == UART7)
    {
        rx_dma_cfg.Init.Request = DMA_REQUEST_UART7_RX;
        tx_dma_cfg.Init.Request = DMA_REQUEST_UART7_TX;

        index = Bsp_UART_Port_7;
    }
    else
        return BspUart_Clock_Error;

    memcpy(obj->tx_dma_hdl, &tx_dma_cfg, sizeof(DMA_HandleTypeDef));
    memcpy(obj->rx_dma_hdl, &rx_dma_cfg, sizeof(DMA_HandleTypeDef));

    rx_dma_reg_state = BspDMA.regist(obj->rx_dma, obj->rx_stream, obj->rx_dma_hdl);
    tx_dma_reg_state = BspDMA.regist(obj->tx_dma, obj->tx_stream, obj->tx_dma_hdl);

    if (!rx_dma_reg_state && !tx_dma_reg_state)
        return BspUart_Clock_Error;

    if(rx_dma_reg_state)
    {
        if (HAL_DMA_Init(To_UartDMA_Handle_Ptr(obj->rx_dma_hdl)) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_LINKDMA(To_Uart_Handle_Ptr(obj->hdl), hdmarx, *To_UartDMA_Handle_Ptr(obj->rx_dma_hdl));

        BspDMA.enable_irq(obj->rx_dma, obj->rx_stream, 5, 0, 0, NULL);
    }

    if(tx_dma_reg_state)
    {
        if (HAL_DMA_Init(To_UartDMA_Handle_Ptr(obj->tx_dma_hdl)) != HAL_OK)
            return BspUart_Clock_Error;

        __HAL_LINKDMA(To_Uart_Handle_Ptr(obj->hdl), hdmatx, *To_UartDMA_Handle_Ptr(obj->tx_dma_hdl));

        BspDMA.enable_irq(obj->tx_dma, obj->tx_stream, 5, 0, 0, NULL);
    }

    return index;
}

static int BspUart_SetIRQ(BspUARTObj_TypeDef *obj)
{
    IRQn_Type irqn;
    int8_t index = Bspuart_None_Index;

    if ((obj == NULL) ||
        (To_Uart_Instance(obj->instance) == NULL))
        return BspUart_Clock_Error;

    if (To_Uart_Instance(obj->instance) == USART1)
    {
        irqn = USART1_IRQn;
        index = Bsp_UART_Port_1;
    }
    else if (To_Uart_Instance(obj->instance) == UART4)
    {
        irqn = UART4_IRQn;
        index = Bsp_UART_Port_4;
    }
    else if (To_Uart_Instance(obj->instance) == USART6)
    {
        irqn = USART6_IRQn;
        index = Bsp_UART_Port_6;
    }
    else if (To_Uart_Instance(obj->instance) == UART7)
    {
        irqn = UART7_IRQn;
        index = Bsp_UART_Port_7;
    }
    else
        return Bspuart_None_Index;

    HAL_NVIC_SetPriority(irqn, 5, 0);
    HAL_NVIC_EnableIRQ(irqn);

    return index;
}

static bool BspUart_Init(BspUARTObj_TypeDef *obj)
{
    int8_t port_index;

    obj->init_state = false;
    port_index = BspUart_Init_Clock(obj);

    if ((port_index < 0) || (To_Uart_Handle_Ptr(obj->hdl) == NULL))
        return false;

    To_Uart_Handle_Ptr(obj->hdl)->Instance = To_Uart_Instance(obj->instance);
    To_Uart_Handle_Ptr(obj->hdl)->Init.BaudRate = obj->baudrate;
    To_Uart_Handle_Ptr(obj->hdl)->Init.WordLength = UART_WORDLENGTH_8B;
    To_Uart_Handle_Ptr(obj->hdl)->Init.StopBits = UART_STOPBITS_1;
    To_Uart_Handle_Ptr(obj->hdl)->Init.Parity = UART_PARITY_NONE;
    To_Uart_Handle_Ptr(obj->hdl)->Init.Mode = UART_MODE_TX_RX;
    To_Uart_Handle_Ptr(obj->hdl)->Init.HwFlowCtl = UART_HWCONTROL_NONE;
    To_Uart_Handle_Ptr(obj->hdl)->Init.OverSampling = UART_OVERSAMPLING_16;
    To_Uart_Handle_Ptr(obj->hdl)->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    To_Uart_Handle_Ptr(obj->hdl)->Init.ClockPrescaler = UART_PRESCALER_DIV1;
    To_Uart_Handle_Ptr(obj->hdl)->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    To_Uart_Handle_Ptr(obj->hdl)->AdvancedInit.OverrunDisable = UART_ADVFEATURE_OVERRUN_DISABLE;

    /* swap tx rx pin */
    if (obj->pin_swap)
        To_Uart_Handle_Ptr(obj->hdl)->AdvancedInit.Swap = UART_ADVFEATURE_SWAP_ENABLE;

    if (HAL_UART_Init(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    obj->irq_type = BspUart_IRQ_Type_Idle;
    if (BspUart_Init_DMA(obj) < 0)
        obj->irq_type = BspUart_IRQ_Type_Byte;

    uint32_t tick = HAL_GetTick();
    while(HAL_GetTick() - tick < 50);

    if (HAL_UARTEx_SetTxFifoThreshold(To_Uart_Handle_Ptr(obj->hdl), UART_TXFIFO_THRESHOLD_1_8) != HAL_OK)
        return false;

    if (HAL_UARTEx_SetRxFifoThreshold(To_Uart_Handle_Ptr(obj->hdl), UART_RXFIFO_THRESHOLD_1_8) != HAL_OK)
        return false;

    if (HAL_UARTEx_DisableFifoMode(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    BspUart_Obj_List[port_index] = obj;

    memset(&(obj->monitor), 0, sizeof(obj->monitor));

    /* enable irq callback */
    switch (obj->irq_type)
    {
        case BspUart_IRQ_Type_Idle: __HAL_UART_ENABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_IDLE); break;
        case BspUart_IRQ_Type_Byte: __HAL_UART_ENABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_RXNE | UART_IT_ERR | UART_IT_ORE); break;
        default: return false;
    }

    __HAL_UART_DISABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_ERR);
    __HAL_UART_DISABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_PE);

    if (BspUart_SetIRQ(obj) < 0)
        return false;

    if (obj->irq_type == BspUart_IRQ_Type_Idle)
    {
        if ((obj->rx_buf == NULL) || (obj->rx_size == 0))
            return false;
        
        /* start dma receive data */
        HAL_UART_Receive_DMA(To_Uart_Handle_Ptr(obj->hdl), obj->rx_buf, obj->rx_size);
    }
    else if (obj->irq_type == BspUart_IRQ_Type_Byte)
    {
        /* start receive irq */
        HAL_UART_Receive_IT(To_Uart_Handle_Ptr(obj->hdl), &obj->rx_single_byte, 1);
    }

    obj->init_state = true;
    return true;
}

static bool BspUart_DeInit(BspUARTObj_TypeDef *obj)
{
    if ((obj == NULL) || !obj->init_state || (obj->hdl == NULL))
        return false;
    
    HAL_UART_DeInit(To_Uart_Handle_Ptr(obj->hdl));
    if (obj->irq_type == BspUart_IRQ_Type_Idle)
    {
        HAL_UART_DMAStop(To_Uart_Handle_Ptr(obj->hdl));
        __HAL_UART_DISABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_IDLE);
    }
    else if (obj->irq_type == BspUart_IRQ_Type_Byte)
    {
        HAL_UART_AbortReceive_IT(To_Uart_Handle_Ptr(obj->hdl));
        __HAL_UART_DISABLE_IT(To_Uart_Handle_Ptr(obj->hdl), UART_IT_RXNE | UART_IT_ORE);
    }

    if (obj->tx_dma_hdl)
        BspDMA.de_init(obj->tx_dma, obj->tx_stream, obj->tx_dma_hdl);

    if (obj->rx_dma_hdl)
        BspDMA.de_init(obj->rx_dma, obj->rx_stream, obj->rx_dma_hdl);

    return true;
}

static bool BspUart_Set_DataBit(BspUARTObj_TypeDef *obj, uint32_t bit)
{
    if (obj || !obj->init_state)
        return false;

    To_Uart_Handle_Ptr(obj->hdl)->Init.WordLength = bit;

    if (HAL_UART_Init(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    return true;
}

static bool BspUart_Set_Parity(BspUARTObj_TypeDef *obj, uint32_t parity)
{
    if (obj || !obj->init_state)
        return false;

    To_Uart_Handle_Ptr(obj->hdl)->Init.Parity = parity;

    if (HAL_UART_Init(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    return true;
}

static bool BspUart_Set_StopBit(BspUARTObj_TypeDef *obj, uint32_t stop_bit)
{
    if (obj || !obj->init_state)
        return false;

    To_Uart_Handle_Ptr(obj->hdl)->Init.StopBits = stop_bit;

    if (HAL_UART_Init(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    return true;
}

static bool BspUart_Swap_Pin(BspUARTObj_TypeDef *obj, bool swap)
{
    if (obj || !obj->init_state)
        return false;

    obj->pin_swap = swap;

    if (swap)
    {
        To_Uart_Handle_Ptr(obj->hdl)->AdvancedInit.Swap = UART_ADVFEATURE_SWAP_ENABLE;
    }
    else
        To_Uart_Handle_Ptr(obj->hdl)->AdvancedInit.Swap = UART_ADVFEATURE_SWAP_DISABLE;

    if (HAL_UART_Init(To_Uart_Handle_Ptr(obj->hdl)) != HAL_OK)
        return false;

    return true;
}

UART_HandleTypeDef *BspUart_GetObj_Handle(BspUART_Port_List index)
{
    if (index >= Bsp_UART_Port_Sum)
        return NULL;

    return (UART_HandleTypeDef *)(BspUart_Obj_List[index]->hdl);
}

static bool BspUart_Transfer(BspUARTObj_TypeDef *obj, uint8_t *tx_buf, uint16_t size)
{
    if ((obj == NULL) || (tx_buf == NULL) || (size == 0))
        return false;

    if (obj->tx_dma_hdl)
    {
        /* send data */
        switch (HAL_UART_Transmit_DMA(To_Uart_Handle_Ptr(obj->hdl), tx_buf, size))
        {
            case HAL_OK:
                obj->monitor.tx_cnt++;
                break;

            case HAL_ERROR:
            case HAL_BUSY:
                obj->monitor.tx_err_cnt++;
                return false;

            default:
                obj->monitor.tx_unknow_err_cnt++;
                return false;
        }
    }
    else
        HAL_UART_Transmit(To_Uart_Handle_Ptr(obj->hdl), tx_buf, size, 10);

    return true;
}

static void BspUart_DMAStopRx(BspUART_Port_List index)
{
    UART_HandleTypeDef *hdl = NULL;

    if (BspUart_Obj_List[index])
    {
        hdl = BspUart_Obj_List[index]->hdl;

        /* Stop UART DMA Rx request if ongoing */
        if ((HAL_IS_BIT_SET(hdl->Instance->CR3, USART_CR3_DMAR)) &&
            (hdl->RxState == HAL_UART_STATE_BUSY_RX))
        {
            CLEAR_BIT(hdl->Instance->CR3, USART_CR3_DMAR);

            /* Abort the UART DMA Rx channel */
            if (hdl->hdmarx != NULL)
            {
                HAL_DMA_Abort(hdl->hdmarx);
            }

            /* Disable RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts */
            CLEAR_BIT(hdl->Instance->CR1, (USART_CR1_RXNEIE | USART_CR1_PEIE));
            CLEAR_BIT(hdl->Instance->CR3, USART_CR3_EIE);

            /* At end of Rx process, restore huart->RxState to Ready */
            hdl->RxState = HAL_UART_STATE_READY;
        }
    }
}

static bool BspUart_Set_Rx_Callback(BspUARTObj_TypeDef *obj, BspUART_Callback callback)
{
    if(obj)
    {
        obj->RxCallback = callback;
        return true;
    }

    return false;
}

static bool BspUart_Set_Tx_Callback(BspUARTObj_TypeDef *obj, BspUART_Callback callback)
{
    if(obj)
    {
        obj->TxCallback = callback;
        return true;
    }

    return false;
}

/******************************** irq callback ***********************************/
void UART_IRQ_Callback(BspUART_Port_List index)
{
    static UART_HandleTypeDef *hdl = NULL;
    static DMA_HandleTypeDef *rx_dma = NULL;
    uint16_t len = 0;
    uint32_t isrflags = 0;
    uint32_t cr1its = 0;

    if ((BspUart_Obj_List[index] == NULL) || \
        BspUart_Obj_List[index]->irq_type != BspUart_IRQ_Type_Idle)
        return;
        
    hdl = BspUart_Obj_List[index]->hdl;
    isrflags = READ_REG(hdl->Instance->ISR);
    cr1its = READ_REG(hdl->Instance->CR1);

    rx_dma = To_UartDMA_Handle_Ptr(BspUart_Obj_List[index]->rx_dma_hdl);

    if ((hdl == NULL) || \
        (rx_dma == NULL) || \
        (RESET == (isrflags & USART_ISR_IDLE)) || \
        (RESET == (cr1its & USART_CR1_IDLEIE)))
        return;

    len = BspUart_Obj_List[index]->rx_size - __HAL_DMA_GET_COUNTER(rx_dma);
    __HAL_UART_CLEAR_IDLEFLAG(hdl);
    BspUart_DMAStopRx(index);
    if (len)
    {
        SCB_InvalidateDCache();

        /* idle receive callback process */
        if (BspUart_Obj_List[index]->RxCallback)
            BspUart_Obj_List[index]->RxCallback(BspUart_Obj_List[index]->cust_data_addr,
                                                BspUart_Obj_List[index]->rx_buf,
                                                len);

        BspUart_Obj_List[index]->monitor.rx_cnt++;
    }
    else
    {
        BspUart_Obj_List[index]->monitor.rx_err_cnt++;
        READ_REG(hdl->Instance->RDR);

        if (isrflags & USART_ISR_ORE)
            __HAL_UART_CLEAR_OREFLAG(hdl);

        if (isrflags & USART_ISR_FE)
            __HAL_UART_CLEAR_FEFLAG(hdl);

        if (isrflags & USART_ISR_NE)
            __HAL_UART_CLEAR_NEFLAG(hdl);

        if (isrflags & USART_ISR_PE)
            __HAL_UART_CLEAR_PEFLAG(hdl);
    }
    
    HAL_UART_Receive_DMA(hdl, BspUart_Obj_List[index]->rx_buf, BspUart_Obj_List[index]->rx_size);
}

/* receive full */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    uint8_t index = 0;

    if (huart->Instance == USART1)
    {
        index = Bsp_UART_Port_1;
    }
    else if (huart->Instance == UART4)
    {
        index = Bsp_UART_Port_4;
    }
    else if (huart->Instance == USART6)
    {
        index = Bsp_UART_Port_6;
    }
    else if (huart->Instance == UART7)
    {
        index = Bsp_UART_Port_7;
    }
    else
        return;

    if (BspUart_Obj_List[index])
    {
        if (BspUart_Obj_List[index]->irq_type == BspUart_IRQ_Type_Idle)
        {
            if (BspUart_Obj_List[index]->RxCallback)
                BspUart_Obj_List[index]->RxCallback(BspUart_Obj_List[index]->cust_data_addr,
                                                    BspUart_Obj_List[index]->rx_buf,
                                                    BspUart_Obj_List[index]->rx_size);

            HAL_UART_Receive_DMA((UART_HandleTypeDef *)(BspUart_Obj_List[index]->hdl), BspUart_Obj_List[index]->rx_buf, BspUart_Obj_List[index]->rx_size);

            BspUart_Obj_List[index]->monitor.rx_full_cnt++;
        }
        else if (BspUart_Obj_List[index]->irq_type == BspUart_IRQ_Type_Byte)
        {
            if (BspUart_Obj_List[index]->RxCallback)
                BspUart_Obj_List[index]->RxCallback(BspUart_Obj_List[index]->cust_data_addr, &BspUart_Obj_List[index]->rx_single_byte, 1);

            HAL_UART_Receive_IT((UART_HandleTypeDef *)(BspUart_Obj_List[index]->hdl), &BspUart_Obj_List[index]->rx_single_byte, 1);
        }
    }
}

/* transfer full */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    uint8_t index = 0;

    if(huart == NULL)
        return;

    if(huart->Instance == USART1)
    {
        index = Bsp_UART_Port_1;
    }
    else if (huart->Instance == UART4)
    {
        index = Bsp_UART_Port_4;
    }
    else if (huart->Instance == USART6)
    {
        index = Bsp_UART_Port_6;
    }
    else if (huart->Instance == UART7)
    {
        index = Bsp_UART_Port_7;
    }
    else
        return;

    if (BspUart_Obj_List[index])
    {
        BspUart_Obj_List[index]->monitor.tx_success_cnt ++;

        if(BspUart_Obj_List[index]->TxCallback)
            BspUart_Obj_List[index]->TxCallback(BspUart_Obj_List[index]->cust_data_addr, NULL, 0);
    }
}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
    uint8_t index = 0;
    
    if(huart == NULL)
        return;

    if(huart->Instance == USART1)
    {
        index = Bsp_UART_Port_1;
    }
    else if (huart->Instance == UART4)
    {
        index = Bsp_UART_Port_4;
    }
    else if (huart->Instance == USART6)
    {
        index = Bsp_UART_Port_6;
    }
    else if (huart->Instance == UART7)
    {
        index = Bsp_UART_Port_7;
    }
    else
        return;
 
    if (BspUart_Obj_List[index] && huart->ErrorCode)
    {
        BspUart_Obj_List[index]->monitor.rx_err_cnt ++;
        
        if(BspUart_Obj_List[index]->irq_type == BspUart_IRQ_Type_Byte)
        {
            if(huart->ErrorCode && HAL_UART_ERROR_ORE)
            {
                BspUart_Obj_List[index]->monitor.ore_cnt ++;

                uint8_t temp = huart->Instance->RDR;
                HAL_UART_Receive_IT((UART_HandleTypeDef *)(BspUart_Obj_List[index]->hdl), &BspUart_Obj_List[index]->rx_single_byte, 1);
            }
        }
    }
}

